Henry/steadystate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xMin 0;
xMax 2;
yMin 0;
yMax 0.1;
zMin 0;
zMax 1;

Nx 200;
Ny 1;
Nz 100;

vertices
(
    ($xMin $yMin $zMin) // 0
    ($xMax $yMin $zMin) // 1
    ($xMax $yMax $zMin) // 2
    ($xMin $yMax $zMin) // 3
    ($xMin $yMin $zMax) // 4
    ($xMax $yMin $zMax) // 5
    ($xMax $yMax $zMax) // 6
    ($xMin $yMax $zMax) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($Nx $Ny $Nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

 left
 {
   type patch;
   faces ((0 4 7 3));
 }

 right
 {
   type patch;
   faces ((1 2 6 5));
 }

 bottom
 {
   type patch;
   faces ((0 3 2 1));
 }

 top
 {
   type patch;
   faces ((4 5 6 7));
 }

 back
 {
   type empty;
   faces ((0 1 5 4));
 }

 front
 {
   type empty;
   faces ((3 7 6 2));
 }
);

mergePatchPairs
(
);

// ************************************************************************* //
