Henry/steadystate/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
Ss             Ss   [-1 1 2 0 0 0 0]   0.0;
Dm             DT   [0 2 -1 0 0 0 0]   6.6e-6; //2.31e-6;  multiplied by porosity.
beta           beta [0 0 0 0 0 0 0]    0.35;
alphaL         alphaL [0 1 0 0 0 0 0]    0.0;
alphaT         alphaT [0 1 0 0 0 0 0]    0.0;
hydrostaticPressure off;
concentrationBased off;
dispersionModel off;
incompressible on;

densityModel
{
  type  linearDensity;
  rho0  1000.;
  //  beta  700.;
  beta  0.6832;
}

viscosityModel
{
  type constantViscosity;
  mu0  1e-3;
}
// ************************************************************************* //
