Henry/steadystate/system/setRandomFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setRandomFieldDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// -- Name of the field
// -- this is read and then use as a (multiplicative) basis
field K;

// -- Type of random field
//type gaussian;
 type logNormal;
// type truncated;
// type bitruncated;
// type uniform;

// -- Correlation function
//correlation exponential;
 correlation gaussian;
// correlation matern;

// -- Correlation lengths
Lcorr           (0.2 10. 0.1);

// -- Correlation tolerance (skip high frequencies)
corrTol         1e-8;

// -- Matern coefficient
nu              1;

// -- Disable dimensions
disableY true;
disableZ false;

// -- Periodic field
periodic false;

// -- Initialisation
reset true; // discard current value
additive false; // sum (or multiply) existing value

// -- Mean and variance of the final field (or the underlying Gaussian)
setFinalStats  false;

// -- Mean and variance
mu             -20.7;//1.020408e-9;
sigma          1.4142;

// -- Number of terms in the expansion
nterms 1;

// -- Number of frequencies in the expansion
nfreq 20;
// nfreqy 20;
// nfreqz 20;

// -- Maximum wave length (cannot be less than 4*Lcorr and more than domain length if periodic)
maxLength (2 1 1);

// -- Print basic output stats
printStats true;
printLogStats true;


// -- For truncated fields
values (1 2 3 4);
thresholds (0);

// -- For bitruncated fields
thresholds2 (0);
